cases/chpt5-tubeBatch-35/constant/old-fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
///*
arcSource1
{
    type            ellipArcSourceH;
//    type            arcSource;
    active          on;

    selectionMode cellSet;
    cellSet      base_metal;
//   selectionMode cellZone;
//    cellZone      base_metal;
//    selectionMode   all;
    fields          (H);
    arc_vel         (-0.00125 0 0);
    arc_pos0        (0 0 0.006);//0.0135);     
    arc_start_t     0;
    omega           0.002333;
    arc_penetration 0.00265;//0.75e-2;//8.82e-4;
/*
    omega           7.6e-4;//2.025e-3;
    arc_penetration 1.2e-3;//4.125e-3; // larger = deeper weld
*/
    arc_eff         1;//0.6;
    arc_power       1742; // 1.75e5;//
    oneMeter        1;
    arcPause        true;
    pauseTime       0;
    endTime         60;
    fieldCut        0.01;
    f_h             0.4;
}
/*
arcSource2
{
    type            ellipArcSourceHprop;
//    type            arcSource;
    active          off;

    selectionMode cellSet;
    cellSet      base_metal;
//    selectionMode cellZone;
//    cellZone      base_metal;
//    selectionMode   all;
    fields          (H);
    arc_vel         (-0.005 0 0);
    arc_pos0        (0.055 0 0.0135);     
    arc_start_t     0;
    arc_radius      1e6; // up is down! Smaller = wider weld!
//    omega           4.875e-4;
    omega           7.5e-3;
    arc_penetration 0.75e-2;//8.82e-4;

//    omega           7.6e-4;//2.025e-3;
//    arc_penetration 1.2e-3;//4.125e-3; // larger = deeper weld

    arc_eff         1;//0.6;
    arc_power       3.5e5; // 1.75e5;//
    oneMeter        1;
    arcPause        true;
    pauseTime       0.5;
    fieldCut        0.05;
    f_h             1;
}
*/
// ************************************************************************* //
