cases/chpt5-tubeBatch-35/constant/sourceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sourceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sourceVel (-0.002977968 0 0);
sourcePos0 (0.0035735616 0 0.00065);
sourcePos1 (-0.0035735616 0 0.00065);
sourcePos2 (0.0107206849304 0 0.00065);
sourceOmega 0.0015;
sourcePenn 	0.0005;
sourceStartTime 0;
sourcePauseTime 3.4;
sourceEndTime 5.8;
source3EndTime 4.6; 
sourcePower 32;
sourceC_C 55.47425;
sourceFieldCut 0.01;

sourcePause true;
sourceTwo true;
sourceThree true;
oneMeter 1;